'use client'
import Breadcrumbs from '@/components/modules/Breadcrumbs/Breadcrumbs'
import { useBreadcrumbs } from '@/hooks/useBreadcrumbs'
import styles from '@/styles/delivery/index.module.scss'

const DeliveryPage = () => {
  const { getDefaultTextGenerator, getTextGenerator } =
    useBreadcrumbs('delivery')
  return (
    <main>
      <Breadcrumbs
        getDefaultTextGenerator={getDefaultTextGenerator}
        getTextGenerator={getTextGenerator}
      />
      <section className={styles.delivery}>
        <div className="container">
          <div className="delivery__wrapper">
            <h2>
              Доставка та оплата
            </h2>
            <h3>Умови безкоштовної доставки</h3>
            <ul>
              <li>
                <span className={styles.green}>—</span> Безкоштовна доставка нашою кур'єрською службою по Києву при замовленні від 500 грн.
              </li>
              <li>
                <span className={styles.green}>—</span> Безкоштовна доставка по Україні і Польщі при перших трьох замовленнях від 5 000 грн.
              </li>
            </ul>
            <p>
             <span className={styles.red}>*</span> Дана послуга надається за мінімальними тарифами транспортних компаній.
              Якщо вам потрібен швидший спосіб доставки, зв'яжіться з нашим менеджером і допоможе підібрати найзручніший і вигідний спосіб доставки.
              У цьому випадку вам потрібно буде сплатити лише різницю між звичайною та швидшою доставкою.
              Термін доставки залежить від вашого регіону або країни.
            </p>
            <h3>Самовивіз</h3>
            <p>Ви можете забрати своє замовлення самостійно у будь-якому з наших магазинів у містах України.</p>
            <h3>Доставка автобусом</h3>
            <p>Доставка здійснюється по Східноєвропейскому регіону. Ви самостійно забираєте замовлення на автовокзалі у водія.
            Термін доставки від 2 до 12 годин.</p>
            <h3>Доставка з використанням сервісу <a className={styles.green} href='#'>blablacar.com.ua</a>  по Україні</h3>
            <p>Доставка здійснюється по Східноєвропейскому регіону. Ви самостійно забираєте замовлення на автовокзалі у водія.
            Термін доставки від 2 до 12 годин.</p>
            <h3>Доставка транспортними компаніями по Україні та Східній Європі</h3>
            <p>Доставка здійснюється до терміналу транспортної компанії або до вашого складу.</p>
            <h3>Оплата готівкою кур'єру при доставці</h3>
            <p>Ви можете сплатити своє замовлення готівкою кур'єру. Виберіть під час оформлення замовлення на сайті відповідний спосіб оплати.
            Оплата провадиться в гривнях. Кур'єр видасть вам документи, що підтверджують оплату та отримання товару.</p>
            <h3>Оплата пластиковою карткою кур'єру при доставці</h3>
            <p>Ви можете сплатити замовлення пластиковою карткою при отриманні. Виберіть під час оформлення замовлення на сайті відповідний спосіб оплати.</p>
            <p>Кур'єр може попросити вас пред'явити документ, що засвідчує особу. Він видасть вам документи, що підтверджують оплату та отримання товару.</p>
            <h3>Онлайн-оплата банківською карткою</h3>
            <p>Ви можете сплатити своє замовлення банківською карткою.</p> 
            <p>Оплата відбувається через ПАТ Приватбанк з використанням Банківських карток наступних платіжних систем:</p>
            <ul>
              <li>
                <span className={styles.green}>—</span> Maestro
              </li>
              <li>
                <span className={styles.green}>—</span> VISA International 
              </li>
              <li>
                <span className={styles.green}>—</span> Mastercard Worldwide 
              </li>
            </ul>
            <p>
              Після того, як ви вибрали спосіб отримання замовлення, ввели адресу доставки та дані одержувача, виберіть спосіб оплати «Картою онлайн» 
            </p>
            <ol>
              <li>1. Натисніть кнопку "оформити замовлення".</li>
              <li>2. На сторінці оплати, що відкрилася, введіть усі запитані дані по Вашій карті<span className={styles.red}>*</span></li>
              <li>3. Після натискання кнопки "Оплатити" з'явиться повідомлення про успішно завершену процедуру оформлення замовлення</li>
            </ol>
            <p>
              Зверніть увагу: Ваша банківська картка повинна дозволяти купувати через Інтернет. Якщо ви не впевнені в наявності цієї можливості, необхідно уточнити це питання у сервісній службі банку, який випустив картку.
            </p>
            <p>
              Оплата провадиться протягом декількох хвилин. Якщо з яких-небудь причин оплата замовлення не була здійснена протягом 15 хвилин, замовлення буде скасовано.
            </p>
            <p>
              Якщо ви бажаєте відмовитися від оплаченого замовлення до його отримання або в момент доставки кур'єром, кошти будуть повернуті на вашу картку в строк до 30 днів за умовами платіжного сервісу.
            </p>
            <p>При виборі цього способу оплати Покупець погоджується з умовами оплати, доставки та повернення товару.</p>
            <h3>Якщо відбулася відмова в авторизації, причини можуть бути:</h3>
            <ul>
              <li>
                <span className={styles.green}>—</span> Банк-емітент не підтримує технологію 3D-Secure;
              </li>
              <li>
                <span className={styles.green}>—</span> На карті недостатньо коштів;
              </li>
              <li>
                <span className={styles.green}>—</span> Банк встановив заборону на оплату в інтернеті;
              </li>
              <li>
                <span className={styles.green}>—</span> Закінчився час очікування введення даних (15 хвилин);
              </li>
            </ul>
            <h3>Що робити при відмові авторизації платежу?</h3>
            <ul>
              <li>
                <span className={styles.green}>—</span> Повторіть спробу через 20 хвилин;
              </li>
              <li>
                <span className={styles.green}>—</span> Зверніться до банку-емітенту;
              </li>
              <li>
                <span className={styles.green}>—</span> Спробуйте сплатити карткою іншого банку.
              </li>
            </ul>
            <p>
              Зверніть увагу, що відвідування сайту, придбання та доставка конкретного товару/послуги можуть бути незаконними на території країни, де знаходиться власник картки.
            </p>
            <p>
              Утримувач картки несе відповідальність за невиконання законів своєї країни при відвідуванні даного сайту та спробі придбати товари/послуги, якщо такі заборонені законодавством на території країни, де він знаходиться.
            </p>
            <p>
              <span className={styles.red}>*</span> Ви будете перенаправлені на платіжний шлюз ПАТ Приватбанк. З'єднання з платіжним шлюзом та передача інформації здійснюється в захищеному режимі за допомогою протоколу шифрування SSL. Якщо Ваш банк підтримує технологію безпечного проведення інтернет-платежів Verified By Visa або MasterCard SecureCode для проведення платежу, також може знадобитися введення спеціального пароля.
            </p>
            <p>
              Цей сайт підтримує 256-бітове шифрування. Конфіденційність персональної інформації забезпечується ПАТ Приватбанк. Введена інформація не буде надана третім особам за винятком випадків, передбачених законодавством України. Проведення платежів за банківськими картками здійснюється у суворій відповідності до вимог платіжних систем СВІТ, Visa Int. та MasterCard Europe Sprl.
            </p>
          </div>
        </div>
      </section>
    </main>
  )
}

export default DeliveryPage