'use client'
import Breadcrumbs from '@/components/modules/Breadcrumbs/Breadcrumbs'
import { useBreadcrumbs } from '@/hooks/useBreadcrumbs'
import styles from '@/styles/policy/index.module.scss'

const PrivacyPolicyPage = () => {
  const { getDefaultTextGenerator, getTextGenerator } =
    useBreadcrumbs('privacy_policy')

  return (
    <main>
      <Breadcrumbs
        getDefaultTextGenerator={getDefaultTextGenerator}
        getTextGenerator={getTextGenerator}
      />
      <section className={styles.policy}>
        <div className='container'>
          <div className='wpb_wrapper'>
            <h2>
              <strong>
                Політика щодо обробки персональних даних
              </strong>
            </h2>
            <h3>1. Загальні положення</h3>
            <p>
                Справжня політика обробки персональних даних складена в
                відповідно до вимог закону від 27.07.2007.
                №152-ДЗ «Про персональні дані» та визначає порядок обробки
                персональних даних та заходи щодо забезпечення безпеки
                персональних даних, що вживаються &nbsp;ТОВ
                «ТЕСТ-БЕЗПЕКА» (далі – Оператор).
            </p>
            <ol>
              <li>
                1.1. Оператор ставить своєю найважливішою метою та умовою
                здійснення своєї діяльності дотримання прав та свобод
                людини та громадянина при обробці його персональних даних,
                в тому числі захисту прав на недоторканність приватного життя,
                особисту та сімейну таємницю.
              </li>
              <li>
                1.2. Справжня політика Оператора щодо обробки
                персональних даних (далі – Політика) застосовується до всієї
                інформації, яку Оператор може отримати про відвідувачів
                веб-сайту&nbsp;
                <a href='https://nodoors.ua'>https://nodoors.ua</a>.
              </li>
            </ol>
            <h3>2. Основні поняття, що використовуються у Політиці</h3>
            <ol>
              <li>
                2.1. Автоматизована обробка персональних даних –
                обробка персональних даних за допомогою засобів обчислювальної
                техніки;
              </li>
              <li>
                2.2. Блокування персональних даних – тимчасове припинення
                обробки персональних даних (за винятком випадків, якщо
                обробка необхідна уточнення персональних даних);
              </li>
              <li>
                2.3. Веб-сайт – сукупність графічних та інформаційних.
                матеріалів, а також програм для ЕОМ та баз даних,
                що забезпечують їх доступність у мережі інтернет по мережному
                адресою&nbsp;
                <a href='https://nodoors.ua'>https://nodoors.ua</a>;
              </li>
              <li>
                2.4. Інформаційна система персональних даних - сукупність
                персональних даних, що містяться в базах даних, та
                що забезпечують їх обробку інформаційних технологій та
                технічних засобів;
              </li>
              <li>
                2.5. Знеособлення персональних даних - дії, в результаті
                яких неможливо визначити без використання додаткової
                інформації про належність персональних даних до конкретного
                Користувачеві чи іншому суб'єкту персональних даних;
              </li>
              <li>
                2.6. Обробка персональних даних – будь-яка дія (операція)
                або сукупність дій (операцій), що здійснюються з
                використанням засобів автоматизації або без використання таких
                коштів з персональними даними, включаючи збирання, запис,
                систематизацію, накопичення, зберігання, уточнення (оновлення,
                зміна), вилучення, використання, передачу
                (поширення, надання, доступ), знеособлення,
                блокування, видалення, знищення персональних даних;
              </li>
              <li>
                2.7. Оператор - державний орган, муніципальний орган,
                юридична або фізична особа, самостійно або спільно з
                іншими особами організують та (або) здійснюють обробку
                персональних даних, а також визначальні цілі обробки
                персональних даних, склад персональних даних, що підлягають
                обробці, дії (операції), що здійснюються з персональними
                даними;
              </li>
              <li>
                2.8. Персональні дані – будь-яка інформація, що стосується прямо
                або опосередковано до певного або визначеного Користувача
                веб-сайту&nbsp;
                <a href='https://nodoors.ua'>https://nodoors.ua</a>;
              </li>
              <li>
                2.9. Користувач – будь-який відвідувач веб-сайту.
                <a href='https://nodoors.ua'>https://nodoors.ua</a>;
              </li>
              <li>
                2.10. Надання персональних даних – дії,
                спрямовані на розкриття персональних даних певній особі
                чи певному колу осіб;
              </li>
              <li>
                2.11. Поширення персональних даних – будь-які дії,
                спрямовані на розкриття персональних даних невизначеному
                колу осіб (передача персональних даних) або на ознайомлення з
                персональними даними необмеженого кола осіб, у тому числі
                оприлюднення персональних даних у засобах масової
                інформації, розміщення в інформаційно-телекомунікаційних
                мережах або надання доступу до персональних даних
                будь-яким іншим способом;
              </li>
              <li>
                2.12. Трансгранична передача
                персональних даних на територію іноземної держави
                органу влади іноземної держави, іноземному фізичному
                або іноземній юридичній особі;
              </li>
              <li>
                2.13. Знищення персональних даних – будь-які дії,
                внаслідок яких персональні дані знищуються безповоротно
                з неможливістю подальшого відновлення змісту
                персональних даних в інформаційній системі персональних даних
                та (або) знищуються матеріальні носії персональних даних.
              </li>
            </ol>
            <h3>
              3. Оператор може обробляти такі персональні дані
              Користувача
            </h3>
            <ol>
              <li>3.1. Прізвище, ім'я, по батькові;</li>
              <li>3.2. Електронна адреса;</li>
              <li>3.3.&nbsp;Номери телефонів;</li>
              <li>
                3.4. Також на сайті відбувається збір та обробка знеособлених
                даних про відвідувачів (в т.ч. файлів cookie) за допомогою сервісів
                інтернет-статистики (Яндекс Метрика та Гугл Аналітика та інших).
              </li>
              <li>
                3.5. Вищезазначені дані далі за текстом Політики
                об'єднані загальним поняттям Персональні дані.
              </li>
            </ol>
            <h3>4. Цілі обробки персональних даних</h3>
            <ol>
              <li>
                4.1. Мета обробки персональних даних Користувача
                -&nbsp;інформування Користувача за допомогою відправки
                електронних листів; висновок, виконання та припинення
                цивільно-правових договорів; надання доступу
                Користувачеві до сервісів, інформації та/або матеріалів,
                що міститься на веб-сайті.
              </li>
              <li>
                4.2. Також Оператор має право надсилати Користувачеві
                повідомлення про нові продукти та послуги, спеціальні
                пропозиціях та різних подіях. Користувач завжди може
                відмовитися від отримання інформаційних повідомлень, надіславши
                Оператору листа на адресу електронної пошти&nbsp;
                <a href='mailto:nodoors@mail.com'>nodoors@mail.com</a>
                &nbsp;з позначкою «Відмова від повідомлень про нові продукти та
                послугах та спеціальних пропозиціях».
              </li>
              <li>
                4.3. Знеособлені дані Користувачів, які збираються за допомогою
                сервісів інтернет-статистики, служать для збору інформації про
                діях Користувачів на сайті, покращення якості сайту та його
                змісту.
              </li>
            </ol>
            <h3>5. Правові основи обробки персональних даних</h3>
            <ol>
              <li>
                5.1. Оператор обробляє персональні дані Користувача
                тільки у разі їх заповнення та/або відправки Користувачем
                самостійно через спеціальні форми, розташовані на
                сайті&nbsp;
                <a href='mailto:nodoors@mail.com'>nodoors@mail.com</a>
                Заповнюючи відповідні форми та/або надсилаючи свої персональні форми
                Дані Оператору, Користувач висловлює свою згоду з даною
                політикою.
              </li>
              <li>
                5.2. Оператор обробляє знеособлені дані про Користувача
                якщо це дозволено в налаштуваннях браузера Користувача
                (включено збереження файлів cookie та використання технології
                JavaScript).
              </li>
            </ol>
            <h3>
              6. Порядок збирання, зберігання, передачі та інших видів обробки
              персональних даних
            </h3>
            <p>
              Безпека персональних даних, що обробляються
              Оператором, що забезпечується шляхом реалізації правових,
              організаційних та технічних заходів, необхідних для виконання
              повному обсязі вимог чинного законодавства у сфері
              захисту персональних даних
            </p>
            <ol>
              <li>
                6.1. Оператор забезпечує збереження персональних даних та
                вживає всіх можливих заходів, що виключають доступ до персональних
                даних неуповноважених осіб.
              </li>
              <li>
                6.2. Персональні дані Користувача ніколи, ні за яких
                умовах не будуть передані третім особам, за винятком
                випадків, пов'язаних із виконанням чинного законодавства.
              </li>
              <li>
                6.3. У разі виявлення неточностей у персональних даних,
                Користувач може актуалізувати їх самостійно шляхом
                направлення Оператору повідомлення на адресу електронної пошти
                Оператора&nbsp;
                <a href='mailto:nodoors@mail.com'>nodoors@mail.com</a>
                &nbsp;з позначкою «Актуалізація персональних даних».
              </li>
              <li>
                6.4. Термін обробки персональних даних є необмеженим.
                Користувач може будь-якої миті відкликати свою згоду на
                обробку персональних даних, надіславши Оператору повідомлення
                за допомогою електронної пошти на електронну адресу
                Оператора&nbsp;
                <a href='mailto:nodoors@mail.com'>nodoors@mail.com</a>
                &nbsp;з позначкою «Відгук згоди на обробку персональних
                даних».
              </li>
            </ol>
            <h3>7. Транскордонна передача персональних даних</h3>
            <ol>
              <li>
                7.1. Оператор на початок здійснення транскордонної передачі
                персональних даних зобов'язаний переконатися, що іноземним
                державою, на територію якої передбачається здійснювати
                передачу персональних даних, забезпечується надійний захист
                прав суб'єктів персональних даних
              </li>
              <li>
                7.2. Транскордонна передача персональних даних на території
                іноземних держав, які не відповідають вищевказаним вимогам,
                може здійснюватися тільки у разі наявності згоди на
                письмовій формі суб'єкта персональних даних на транскордонну
                передачу його персональних даних та/або виконання договору,
                стороною якого є суб'єкт персональних даних.
              </li>
            </ol>
            <h3>8. Заключні положення</h3>
            <ol>
              <li>
                8.1. Користувач може отримати будь-які роз'яснення щодо
                питанням, що цікавлять, щодо обробки його персональних
                даних, звернувшись до Оператора за допомогою електронної
                пошти&nbsp;
                <a href='mailto:nodoors@mail.com'>nodoors@mail.com</a>
                .
              </li>
              <li>
                8.2. У цьому документі буде відображено будь-які зміни політики
                оброблення персональних даних Оператором. Політика діє
                безстроково до заміни її новою версією.
              </li>
            </ol>
            <p>&nbsp;</p>
          </div>
        </div>
      </section>
    </main>
  )
}

export default PrivacyPolicyPage
